#pragma once
#include "LightImpositionTypes.h"
#include "DataShield.h"

/******************************************************************************************
		СОГЛАШЕНИЕ О НУМЕРОВАНИИ ЯЧЕЕК МАТРИЦЫ ШАБЛОНА
Номера столбцов начинаются с левого нижнего угла. Направление заполнения позиций изменяется
через 2 - т.е. первых два - снизу-вверх, вторых два - сверху-вниз и т.д.
*******************************************************************************************/
//-----------------------------------------------------------------------------------------
// БАЗОВЫЙ КЛАСС ПРИВОДА СПУСКА ПОЛОС
//-----------------------------------------------------------------------------------------
class CImpositionCore
{
	// Матрица
	M_MATRIX m_MatrixA;     // Матрица лицевой стороны (или полная при печати с одной матрицой)
	M_MATRIX m_MatrixB;     // Матрица обратной стороны при печати STANDARD
	T_MATRIX m_TMatrix;     // Полная матрица шаблона импозиции

	CDataShield* m_Data;	// Указатель на хранилище параметров
	//=====================================================================================
	// Служебные методы класса
	//=====================================================================================
	// Методы предварительной импозиции
	void ImposeA();				// Вспомогательный метод формирования первой полуматрицы
	void ImposeB();				// Вспомогательный метод формирования второй полуматрицы
	void ComposeFullMatrix();	// Вспомогательный метод формирования полной матрицы шаблона
	// Подготовка полуматриц для заполнения
	void PrepareMatrices();
public:
	CImpositionCore(CDataShield* shield);
	~CImpositionCore(void);
	//=====================================================================================
	// Непосредственно алгоритм формирования матрицы спуска полос
	//=====================================================================================
	void Impose();
	//=====================================================================================
	// Получение матрицы шаблона и его характеристик
	//=====================================================================================
	T_MATRIX GetTemlateMatrix();
};

